In [83]:
import pandas as pd
import numpy as np

### to store one dimension data using pandas series datastructure

In [84]:
list1=["a","b","c","d","e"]
series1=pd.Series(list1,index=['A','B','C','D','E'])

In [85]:
series1

A    a
B    b
C    c
D    d
E    e
dtype: object

In [86]:
array=np.random.randint(20,25,
size=(9))

In [87]:
array

array([20, 20, 20, 21, 23, 23, 20, 24, 22], dtype=int32)

In [88]:
series2=pd.Series(array)

In [89]:
series2

0    20
1    20
2    20
3    21
4    23
5    23
6    20
7    24
8    22
dtype: int32

In [90]:
series3=pd.Series(np.random.randint(30,35,size=(10)))

In [91]:
series3

0    31
1    30
2    31
3    31
4    32
5    31
6    30
7    32
8    32
9    30
dtype: int32

In [92]:
print(series1,series2,series3)

A    a
B    b
C    c
D    d
E    e
dtype: object 0    20
1    20
2    20
3    21
4    23
5    23
6    20
7    24
8    22
dtype: int32 0    31
1    30
2    31
3    31
4    32
5    31
6    30
7    32
8    32
9    30
dtype: int32

In [93]:
print(series2+series3)

0    51.0
1    50.0
2    51.0
3    52.0
4    55.0
5    54.0
6    50.0
7    56.0
8    54.0
9     NaN
dtype: float64

In [94]:
print(series2-series3)

0   -11.0
1   -10.0
2   -11.0
3   -10.0
4    -9.0
5    -8.0
6   -10.0
7    -8.0
8   -10.0
9     NaN
dtype: float64

In [95]:
print(series2%series3)

0    20.0
1    20.0
2    20.0
3    21.0
4    23.0
5    23.0
6    20.0
7    24.0
8    22.0
9     NaN
dtype: float64

In [96]:
print(series2/series3)

0    0.645161
1    0.666667
2    0.645161
3    0.677419
4    0.718750
5    0.741935
6    0.666667
7    0.750000
8    0.687500
9         NaN
dtype: float64

dataframe

In [97]:
students=["student1",
          "student2",
          "student3",
          "student4",
          "student5"]
rollno=["001",
        "002",
        "003",
        "004",
        "005"]
scores=[45,56,67,89,45]

In [98]:
record={
    "student":students,
    "rollno":rollno,
    "scores":scores
}

In [99]:
record

{'student': ['student1', 'student2', 'student3', 'student4', 'student5'],
 'rollno': ['001', '002', '003', '004', '005'],
 'scores': [45, 56, 67, 89, 45]}

In [100]:
record_df=pd.DataFrame(record)

In [101]:
record_df

    student rollno  scores
0  student1    001      45
1  student2    002      56
2  student3    003      67
3  student4    004      89
4  student5    005      45

In [102]:
record_df.set_index(["rollno","scores"])

                student
rollno scores
001    45      student1
002    56      student2
003    67      student3
004    89      student4
005    45      student5

In [103]:
dict1={
    "A":[1,23,45,67,56],
    "B":[13,45,67,89,70],
    "C":[23,45,77,12,90],
    "D":[34,55,43,56,67],
    "E":[24,56,78,90,45]

}
dict1

{'A': [1, 23, 45, 67, 56],
 'B': [13, 45, 67, 89, 70],
 'C': [23, 45, 77, 12, 90],
 'D': [34, 55, 43, 56, 67],
 'E': [24, 56, 78, 90, 45]}

In [104]:
dict_df=pd.DataFrame(dict1)

In [105]:
dict_df

    A   B   C   D   E
0   1  13  23  34  24
1  23  45  45  55  56
2  45  67  77  43  78
3  67  89  12  56  90
4  56  70  90  67  45

In [106]:
df_1=pd.DataFrame(dict1)

In [107]:
df_1

    A   B   C   D   E
0   1  13  23  34  24
1  23  45  45  55  56
2  45  67  77  43  78
3  67  89  12  56  90
4  56  70  90  67  45

In [108]:
df_1.columns

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [109]:
df_1["A"]

0     1
1    23
2    45
3    67
4    56
Name: A, dtype: int64

In [110]:
df_1["A"]

0     1
1    23
2    45
3    67
4    56
Name: A, dtype: int64

In [111]:
df_1["E"]=df_1["A"]+df_1["B"] +df_1["C"] +df_1["D"]
df_1

    A   B   C   D    E
0   1  13  23  34   71
1  23  45  45  55  168
2  45  67  77  43  232
3  67  89  12  56  224
4  56  70  90  67  283

In [112]:
df_1["F"]=df_1["E"]/4
df_1

    A   B   C   D    E      F
0   1  13  23  34   71  17.75
1  23  45  45  55  168  42.00
2  45  67  77  43  232  58.00
3  67  89  12  56  224  56.00
4  56  70  90  67  283  70.75

### INFO METHOD

In [113]:
df_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int64
 1   B       5 non-null      int64
 2   C       5 non-null      int64
 3   D       5 non-null      int64
 4   E       5 non-null      int64
 5   F       5 non-null      float64
dtypes: float64(1), int64(5)
memory usage: 372.0 bytes

handaling null value

In [114]:
dict2={
    "students":["student1", "student2","student3","student4","student5"],
    "rollno":["001", np.nan,"004","005",np.nan],
    "gender":["male","female","male","female","male"],
    "markss_obtained":[45,67,89,34,56]

}

In [115]:
dict2

{'students': ['student1', 'student2', 'student3', 'student4', 'student5'],
 'rollno': ['001', nan, '004', '005', nan],
 'gender': ['male', 'female', 'male', 'female', 'male'],
 'markss_obtained': [45, 67, 89, 34, 56]}

In [116]:
student_df=pd.DataFrame(dict2)

In [117]:
student_df

   students rollno  gender  markss_obtained
0  student1    001    male               45
1  student2    NaN  female               67
2  student3    004    male               89
3  student4    005  female               34
4  student5    NaN    male               56

to check null alue

In [118]:
student_df.isnull()

   students  rollno  gender  markss_obtained
0     False   False   False            False
1     False    True   False            False
2     False   False   False            False
3     False   False   False            False
4     False    True   False            False

In [119]:
student_df.isna()

   students  rollno  gender  markss_obtained
0     False   False   False            False
1     False    True   False            False
2     False   False   False            False
3     False   False   False            False
4     False    True   False            False

In [121]:
student_df.isnull().sum()

students           0
rollno             2
gender             0
markss_obtained    0
dtype: int64

to check duplicate value in the record

In [123]:
student_df.nunique()

students           5
rollno             3
gender             2
markss_obtained    5
dtype: int64

In [124]:
student_df.duplicated()

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [125]:
student_df.duplicated().sum()

np.int64(0)

rmoving duplicate values

In [126]:
student_df.drop_duplicates()

   students rollno  gender  markss_obtained
0  student1    001    male               45
1  student2    NaN  female               67
2  student3    004    male               89
3  student4    005  female               34
4  student5    NaN    male               56

to drop null values

In [128]:
student_df.dropna()

   students rollno  gender  markss_obtained
0  student1    001    male               45
2  student3    004    male               89
3  student4    005  female               34